tap "homebrew/cask"
tap "homebrew-ffmpeg/ffmpeg"

# system
brew "git"
brew "make"

# javascript
brew "yarn"
cask "docker"

# web browsers
cask "firefox"
cask "google-chrome"

# utilities
brew "libicns"
brew "jq"
brew "unrar"
cask "1password"
cask "backblaze"
cask "cold-turkey-blocker"
cask "cricut-design-space"
cask "dash"
cask "flux"
cask "keyboard-maestro"
cask "nordvpn"
cask "pock"
cask "rescuetime"
cask "wacom-tablet"
mas "Giphy Capture", id: 668208984

# communications
cask "discord"
cask "slack"
cask "whatsapp"

# editors
cask "visual-studio-code"
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# media
brew "homebrew-ffmpeg/ffmpeg/ffmpeg"
brew "imagemagick"
cask "blender"
cask "clip-studio-paint"
cask "figma"
cask "native-access"
cask "obs"
cask "steam"
cask "vlc"
mas "DaVinci Resolve", id: 571213070
mas "Logic Pro X", id: 634148309
