tap "homebrew/cask"

# version control
brew "git"

# javascript
brew "nvm"
brew "yarn"

# media encoding
brew "imagemagick"
brew "ffmpeg"

# web browsers
cask "firefox"
cask "google-chrome"

# utilities
brew "jq"
cask "1password"
cask "adobe-creative-cloud"
cask "dash"
cask "flux"
cask "keyboard-maestro"
cask "nordvpn"
cask "paragon-ntfs"
cask "rescuetime"
cask "runjs"
cask "slack"
cask "whatsapp"
cask "homebrew/cask-drivers/logitech-gaming-software"
cask "cricut-design-space"
mas "Giphy Capture", id: 668208984
mas "Type Fu", id: 509818877

# editors
cask "visual-studio-code"
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# containers
cask "docker"
cask "google-cloud-sdk"
cask "minikube"

# media
cask "blender"
cask "homebrew/cask-drivers/focusrite-saffire-mixcontrol"
cask "musescore"
cask "native-access"
cask "unity"
cask "unity-web-player"
cask "unity-webgl-support-for-editor"
mas "Davinci Resolve", id: 571213070
mas "Logic Pro X", id: 634148309
