tap "homebrew/cask"

# version control
brew "git"
brew "make"

# javascript
brew "nvm"
brew "yarn"

# media encoding
brew "imagemagick"
brew "ffmpeg"

# web browsers
cask "firefox"
cask "google-chrome"

# utilities
brew "libicns"
brew "jq"
brew "unrar"
cask "1password"
cask "adobe-creative-cloud"
cask "backblaze"
cask "cold-turkey-blocker"
cask "cricut-design-space"
cask "dash"
cask "flux"
cask "keyboard-maestro"
cask "nordvpn"
cask "parallels"
cask "rescuetime"
cask "runjs"
cask "slack"
cask "discord"
cask "wacom-tablet"
cask "whatsapp"
mas "Giphy Capture", id: 668208984
mas "Type Fu", id: 509818877

# editors
cask "visual-studio-code"
mas "Numbers", id: 409203825
mas "Pages", id: 409201541

# data
# cask "neo4j"
# cask "graphiql"

# containers
cask "docker"
cask "google-cloud-sdk"

# media
cask "blender"
cask "homebrew/cask-drivers/focusrite-saffire-mixcontrol"
cask "musescore"
cask "native-access"
cask "steam"
cask "obs"
cask "unity"
cask "unity-hub"
mas "Logic Pro X", id: 634148309
